###############################################################################
#
#   [1]. 아래 계산 결과를 구하고 화면에 출력하시오. 
#
#   5를 제곱한 결과를 7로 나눈 나머지 값은 얼마인가?
#
###############################################################################

n = 
print(n)


###############################################################################
#
#   [2]. 하나의 변수 n을 반복해서 사용하여 1부터 10까지의 자연수의 합을 구하시오.
#   즉, 1 + 2 + 3 + ... + 9 + 10 = ?
#
###############################################################################

n = 0
n = n + 1

# Describe your code
# ...

print(n)


###############################################################################
#
#   [3]. 아래 비교 연산의 결과인 b, b2를 화면에 출력하고, 이 두 결과를 or 연산한 결과를 출력하시오.
#
#   b = 3=='3'      # 등호 2개 -> 왼쪽 값과 오른쪽 값이 같은지 비교.
#   b2 = (3*2) < 7
#
###############################################################################




###############################################################################
#
#   [4]. 아래 문장을 파이썬 문자열 데이터로 표현한 후 변수 s에 저장하는 코드를 완성하시오.
#
#   Do not be afraid to try, whether you succeed or not.
#
###############################################################################

s =
print(s)


###############################################################################
#
#   [5]. 문자열을 다루기 위한 함수 중 split() 함수를 사용하여
#   문제 [4]에서 생성한 문자열 데이터를 쉼표를 기준으로 두 부분으로 나누는 파이썬 코드를 작성하시오.
#
#   *split() 함수는 ()안에 전달한 문자를 기준으로 문자열을 잘라서 리스트에 넣어줍니다.
#
#   Do not be afraid to try, whether you succeed or not.
#
###############################################################################

s2 =
print(s2)


###############################################################################
#
#   [6]. 문자열을 다루기 위한 함수 중 index() 함수와 문자열 슬라이싱 방법을 이용해서
#   문제 [4]에서 생성한 문자열 데이터에서 Do not be afraid to try 부분을 읽는 파이썬 코드를 작성하시오.
#
#   *index() 함수는 ()안에 전달한 문자열 패턴의 시작 인덱스를 찾아서 반환해(알려)줍니다.
#
#   Do not be afraid to try, whether you succeed or not.
#
###############################################################################

i = s.index()
print(i)

s3 = s[]
print(s3)

