
#######################################################################################
#
#   1. for 반복문을 이용해서 1~10의 숫자로 이루어진 리스트에서 원소들을 출력하시오.
#
#######################################################################################

numUnderTen = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

for :
    print()


#######################################################################################
#
#   2. 1~10의 숫자로 이루어진 리스트를 range() 함수를 이용해서 생성하고,
#   생성한 리스트의 원소들을 for 반복문을 이용해서 출력하시오.
#
#######################################################################################

numUnderTen2 =
# print('numUnerTen2:', numUnerTen2)

for :
    print()


#######################################################################################
#
#   3. 1~10의 숫자로 구성된 리스트를 생성하고(직접 작성, range() 사용 둘 중 어떤 방법도 좋음),
#   for 반복문과 if-else 조건문을 이용하여 리스트에서 짝수 값 만 출력하시오.
#
#######################################################################################

numUnderTen3 =

for item in numUnderTen3:
    if :
        continue
    else:
        print()


#######################################################################################
#
#   4. 1~9의 숫자로 구성된 리스트를 생성하고(직접 작성, range() 사용 둘 중 어떤 방법도 좋음),
#   생성한 리스트와 for 반복문을 이용하여 구구단을 만들고 화면에 출력하시오
#
#   힌트: 중첩 반복문을 생각해 볼 것.
#
#######################################################################################

oneToNine =

for :
    for :
        print(num1*num2, end=' ')
    print('')


#######################################################################################
#
#   5. 1~9의 숫자로 구성된 리스트를 생성하고(직접 작성, range() 사용 둘 중 어떤 방법도 좋음),
#   enumerate() 함수와 for 반복문을 이용하여 리스트의 인덱스와 값(원소)의 쌍을 화면에 출력하시오.
#
#######################################################################################

for  in :
    print()


#######################################################################################
#
#   6. enumerate() 함수와 for 반복문을 이용하여 위 문제 5에서 생성한 리스트에서 
#   인덱스 0, 2, 4, ..., 즉 홀수 번째 위치의 값(원소)들 만 화면에 출력하시오.
#
#######################################################################################

for  in :
    if :
        continue
    else:
        print()


#######################################################################################
#
#   7. 1~9의 숫자로 구성된 리스트를 생성하고(직접 작성, range() 사용 둘 중 어떤 방법도 좋음),
#   enumerate() 함수와 for 반복문을 이용하여 구구단의 홀수단 만 화면에 출력하는 코드를 작성하시오.
#
#######################################################################################



#######################################################################################
#   문제 해결을 위해 코드를 작성하는 일반적인 접근 방법 예: 구구단
#######################################################################################

# ① 구구단이 만들어지는 과정을 정리해본다.

# ② [1, 2, 3, ..., 9]의 숫자들과 반복문을 이용해서 단을 생성한다.

# ③ 각 단 안에서 역시 [1, 2, 3, ..., 9]의 숫자들을 또 다른 반복문으로 차례로 읽어 열을 생성한다.

# ④ 단에 해당하는 값과 열에 해당하는 값을 곱해서(단x열) 구구단의 값을 생성한다.

# ⑤ 생성한 구구단 값을 화면에 표시한다.

# ⑥ ①~⑤에서 정리한 각 단계를 파이썬 문법으로 어떻게 옮길지 생각하고 문법에 맞게 작성(코딩)해 본다.

# ⑦ 작성한 코드가 정상적으로 동작하는지 테스트하고 잘못된 부분은 찾아서 고친다(print() 함수 이용).
