####################################################
# 
# 1. 파이썬 가상실행환경을 설치 및 활성화하고, 필요 시 pandas 라이브러리를 설치하시오.
# 
####################################################

# ① 가상실행환경을 활성화하는 명령어는 무엇인가?

# ② 가상실행환경에 설치되어 있는 라이브러리들을 확인하는 명령어는 무엇인가?

# ③ 가상실행환경에 라이브러리를 설치하는 명령어는 무엇인가?

####################################################
# 
# 2. pandas 라이브러리를 pd라는 별명으로 스크립트로 가져오시오(import).
# 
####################################################



####################################################
# 
# 3. 아래와 같은 내용을 가지는 Series를 생성하고, 
# 생성한 Series 전체, index만, 그리고 데이터(values)만을 각각 화면에 표시하시오.
# 
# index, value
# 'zero', 0
# 'two', 2
# 'four', 4
# 'six', 6
# 'eight', 8
# 
####################################################



####################################################
# 
# 4. 위 Series에서 'four'~'eight'행을 
# ①행 식별자(인덱스)를 직접 지정하는 방법, 
# ②loc 방법, 
# ③iloc 방법으로 각각 읽어 화면에 표시하시오.
# 
####################################################



####################################################
#
# 5. 위에서 생성한 Series에서 데이터 값의 크기가 6 이상(>=)인 행들을 
#  
# ①행 식별자(인덱스)를 직접 지정하는 방법, 
# ②loc 방법, 
# ③iloc 방법으로 각각 읽어 화면에 표시하시오.
# 
####################################################


