
####################################################
# 
# 1. 파이썬 가상실행환경을 설치 및 활성화하고, 필요 시 pandas 라이브러리를 설치하시오.
# 
####################################################

# ① 가상실행환경을 활성화하는 명령어는 무엇인가?

# ② 가상실행환경에 설치되어 있는 라이브러리들을 확인하는 명령어는 무엇인가?

# ③ 가상실행환경에 라이브러리를 설치하는 명령어는 무엇인가?

####################################################
# 
# 2. pandas 라이브러리를 pd라는 별명으로 스크립트로 가져오시오(import).
# 
####################################################



####################################################
# 
# 3. 아래 내용을 저장하는 pandas DataFrame을 생성하고, 
# ① 전체 내용,
# ② 행 식별자(index)만,
# ③ "name" 컬럼만 각각 화면에 표시하시오.
#
# index, name, sugar, cream
# 'm', 'mocha', 10, 5
# 'c', 'cappuccino', 20, 10
# 'l', 'latte', 0, 15
# 'e', 'espresso', 0, 0
# 'v', 'vienna', 10, 20
# 
####################################################



####################################################
#
# 4. 위에서 생성한 DataFrame에서 'cappuccino', 'latte', 'espresso' 커피의 행(row)들을 
# ①행과 열 식별자를 직접 지정하는 방법,
# ②loc 방법,
# ③iloc 방법으로 각각 읽어 화면에 표시하시오.
# 
####################################################



####################################################
#
# 5. 위에서 생성한 DataFrame에서 cream이 10 이하(<=)로 포함된 커피의 행(row)들을
# ①행과 열 식별자를 직접 지정하는 방법,
# ②loc 방법,
# ③iloc 방법으로 각각 읽어 화면에 표시하시오.
# 
####################################################



####################################################
#
# 6. 데이터프레임의 map 메서드(함수)를 이용해서 'cream' 컬럼의 각 행의 값에 5를 더하고,
# 'sugar' 컬럼의 각 행의 값 중 5보다 큰 값에서 5를 뺀 데이터프레임을 만드시오.
#
####################################################



####################################################
#
# 7. 스크립트 6의 결과 데이터프레임의 'sugar'열과 'cream'열의 평균을 
# apply 메서드와 아래 평균을 계산하는 함수를 이용해서 구하시오.
#
####################################################

def calcAverage(items):
    sum = 0

    for item in items:
        sum = sum + item

    avg = sum/len(items)

    return avg

