import pandas as pd

raw = pd.read_csv('penguins.csv')
df = raw.copy()

# 데이터 획득 결과 확인
print('df.head(5):\n', df.head(5))
print('df.shape:', df.shape)
print('type(df):', type(df))


#   데이터 전처리: 결측치 처리 - 레이블 인코딩 - 더미변수 처리 - 이상치 제거 - 정규화
#   독립변수(입력): 범주형+연속형. 종속변수(출력): 범주형 --> 독립변수를 레이블 인코딩으로 통해 연속형으로 변환한 후 앙상블 기법 활용.

###################################
#   1-1. 데이터 전처리 - 결측치 처리
###################################



###################################
#   1-2. 데이터 전처리 - 레이블 인코딩
###################################



###################################
#   1-3. 데이터 전처리 - 더미변수 변환
###################################



###################################
#   1-4. 데이터 전처리 - 이상치 제거
###################################



###################################
#   1-5. 데이터 전처리 - 정규화
###################################



###################################
#   1-6. 데이터 전처리 - 데이터 분리
###################################



###################################
#   2. 모형 훈련 및 적용
###################################



###################################
#   3. 모형 성능 검증
###################################



###################################
#   4. 하이퍼 파라미터 최적화
###################################

#   ex.) number of perceptrons in neural net
#   ex.) number of estimators in randomforest
#   and so on

###################################
#   5. 결과 정리
###################################



